## [dev-cp](https://walter.app.spacelift.io/stack/dev-cp/run/01HWQP1PXJ52DDC3PVMMEGTMPB) plan logs

<details>
<summary>Click here to expand</summary>

```
[01HWQ6XNQNZ415BZEMJHKS0MW8] Planning changes with 0 custom hooks...
time=2024-04-30T14:20:52Z level=info msg=The stack at /mnt/workspace/source/infra/dev-cp will be processed in the following order for command plan:
Group 1
- Module /mnt/workspace/source/infra/dev-cp/us-east-1/playground/vpc


aws_vpc.this[0]: Refreshing state... [id=vpc-05021b0fb1bcc3891]
aws_default_security_group.this[0]: Refreshing state... [id=sg-007936ae822d75dd0]
aws_default_route_table.default[0]: Refreshing state... [id=rtb-095648969377e8164]
aws_default_network_acl.this[0]: Refreshing state... [id=acl-0fb72959e3fc04826]
aws_subnet.private[2]: Refreshing state... [id=subnet-0bd8c0b736e63beb2]
aws_subnet.private[0]: Refreshing state... [id=subnet-0f50886fa69747fb3]
aws_route_table.private[2]: Refreshing state... [id=rtb-09821713b6b3614c8]
aws_subnet.database[0]: Refreshing state... [id=subnet-0ba7274d5d8566568]
aws_route_table.private[0]: Refreshing state... [id=rtb-0232fd9178bf0a5ee]
aws_subnet.private[1]: Refreshing state... [id=subnet-06b6057974d274b3b]
aws_route_table.private[1]: Refreshing state... [id=rtb-06779be6a525d8670]
aws_subnet.database[1]: Refreshing state... [id=subnet-0e49972a657835651]
aws_route_table.public[0]: Refreshing state... [id=rtb-02b3ba9863435e131]
aws_subnet.database[2]: Refreshing state... [id=subnet-0a2bfc09b21f15ed3]
aws_subnet.public[0]: Refreshing state... [id=subnet-068a78f6e1aa7279c]
aws_subnet.public[2]: Refreshing state... [id=subnet-06a89cf9c926edbda]
aws_subnet.public[1]: Refreshing state... [id=subnet-0845102fc1612914f]
aws_internet_gateway.this[0]: Refreshing state... [id=igw-0652c8a73746c5596]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0fc04132721e149bf]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-042c0eab3da3afa02]
aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0ad36f8f32e1ef747]
aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-02b3ba9863435e1311080289494]
aws_db_subnet_group.database[0]: Refreshing state... [id=dev-cp-playground]
aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-069837c75786d7693]
aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-01a6ce3ca72727013]
aws_route_table_association.database[2]: Refreshing state... [id=rtbassoc-031afbafebda209c7]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-001e616ed4b8f1f18]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0faf52c9343a39745]
aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-019f94c261ffce342]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Entity"      = "cp"
          + "Environment" = "dev-cp-playground"
          + "Name"        = "dev-cp-playground-us-east-1a"
          + "Region"      = "us-east-1"
          + "Terraform"   = "true"
          + "Tier"        = "dev"
          + "Unit"        = "playground"
        }
      + tags_all             = {
          + "Entity"      = "cp"
          + "Environment" = "dev-cp-playground"
          + "Name"        = "dev-cp-playground-us-east-1a"
          + "Region"      = "us-east-1"
          + "Terraform"   = "true"
          + "Tier"        = "dev"
          + "Unit"        = "playground"
        }
      + vpc                  = (known after apply)
    }

  # aws_eip.nat[1] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Entity"      = "cp"
          + "Environment" = "dev-cp-playground"
          + "Name"        = "dev-cp-playground-us-east-1b"
          + "Region"      = "us-east-1"
          + "Terraform"   = "true"
          + "Tier"        = "dev"
          + "Unit"        = "playground"
        }
      + tags_all             = {
          + "Entity"      = "cp"
          + "Environment" = "dev-cp-playground"
          + "Name"        = "dev-cp-playground-us-east-1b"
          + "Region"      = "us-east-1"
          + "Terraform"   = "true"
          + "Tier"        = "dev"
          + "Unit"        = "playground"
        }
      + vpc                  = (known after apply)
    }

  # aws_eip.nat[2] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Entity"      = "cp"
          + "Environment" = "dev-cp-playground"
          + "Name"        = "dev-cp-playground-us-east-1c"
          + "Region"      = "us-east-1"
          + "Terraform"   = "true"
          + "Tier"        = "dev"
          + "Unit"        = "playground"
        }
      + tags_all             = {
          + "Entity"      = "cp"
          + "Environment" = "dev-cp-playground"
          + "Name"        = "dev-cp-playground-us-east-1c"
          + "Region"      = "us-east-1"
          + "Terraform"   = "true"
          + "Tier"        = "dev"
          + "Unit"        = "playground"
        }
      + vpc                  = (known after apply)
    }

  # aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = "subnet-068a78f6e1aa7279c"
      + tags                               = {
          + "Entity"      = "cp"
          + "Environment" = "dev-cp-playground"
          + "Name"        = "dev-cp-playground-us-east-1a"
          + "Region"      = "us-east-1"
          + "Terraform"   = "true"
          + "Tier"        = "dev"
          + "Unit"        = "playground"
        }
      + tags_all                           = {
          + "Entity"      = "cp"
          + "Environment" = "dev-cp-playground"
          + "Name"        = "dev-cp-playground-us-east-1a"
          + "Region"      = "us-east-1"
          + "Terraform"   = "true"
          + "Tier"        = "dev"
          + "Unit"        = "playground"
        }
    }

  # aws_nat_gateway.this[1] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = "subnet-0845102fc1612914f"
      + tags                               = {
          + "Entity"      = "cp"
          + "Environment" = "dev-cp-playground"
          + "Name"        = "dev-cp-playground-us-east-1b"
          + "Region"      = "us-east-1"
          + "Terraform"   = "true"
          + "Tier"        = "dev"
          + "Unit"        = "playground"
        }
      + tags_all                           = {
          + "Entity"      = "cp"
          + "Environment" = "dev-cp-playground"
          + "Name"        = "dev-cp-playground-us-east-1b"
          + "Region"      = "us-east-1"
          + "Terraform"   = "true"
          + "Tier"        = "dev"
          + "Unit"        = "playground"
        }
    }

  # aws_nat_gateway.this[2] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = "subnet-06a89cf9c926edbda"
      + tags                               = {
          + "Entity"      = "cp"
          + "Environment" = "dev-cp-playground"
          + "Name"        = "dev-cp-playground-us-east-1c"
          + "Region"      = "us-east-1"
          + "Terraform"   = "true"
          + "Tier"        = "dev"
          + "Unit"        = "playground"
        }
      + tags_all                           = {
          + "Entity"      = "cp"
          + "Environment" = "dev-cp-playground"
          + "Name"        = "dev-cp-playground-us-east-1c"
          + "Region"      = "us-east-1"
          + "Terraform"   = "true"
          + "Tier"        = "dev"
          + "Unit"        = "playground"
        }
    }

  # aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-0232fd9178bf0a5ee"
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # aws_route.private_nat_gateway[1] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-06779be6a525d8670"
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # aws_route.private_nat_gateway[2] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-09821713b6b3614c8"
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ nat_ids                                     = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  ~ nat_public_ips                              = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  ~ natgw_ids                                   = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  ~ natgw_interface_ids                         = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  ~ private_nat_gateway_route_ids               = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
time=2024-04-30T14:21:06Z level=info msg=time=2024-04-30T14:20:52Z level=warning msg=Detected that init is needed, but Auto-Init is disabled. Continuing with further actions, but subsequent terraform commands may fail. prefix=[/mnt/workspace/source/infra/dev-cp/us-east-1/playground/vpc] 

[01HWQ6XNQNZ415BZEMJHKS0MW8] Successfully planned changes
[01HWQ6XNQNZ415BZEMJHKS0MW8] Retrieving the dependency graph...
[01HWQ6XNQNZ415BZEMJHKS0MW8] Getting path for module us-east-1/playground/vpc
[01HWQ6XNQNZ415BZEMJHKS0MW8] Storing original state file for /mnt/workspace/source/infra/dev-cp/us-east-1/playground/vpc/.terragrunt-cache/pg7Za_BKUWEJgkQm4x2U-N6PXZg/A35GeYiqYDYXDWZftKtd1kkU5ic module
[01HWQ6XNQNZ415BZEMJHKS0MW8] Uploading the list of managed resources...
[01HWQ6XNQNZ415BZEMJHKS0MW8] Retrieving the dependency graph...
[01HWQ6XNQNZ415BZEMJHKS0MW8] Getting path for module us-east-1/playground/vpc
[01HWQ6XNQNZ415BZEMJHKS0MW8] Analyzing plan for module us-east-1/playground/vpc in directory /mnt/workspace/source/infra/dev-cp/us-east-1/playground/vpc/.terragrunt-cache/pg7Za_BKUWEJgkQm4x2U-N6PXZg/A35GeYiqYDYXDWZftKtd1kkU5ic
[01HWQ6XNQNZ415BZEMJHKS0MW8] Uploading the list of managed resources...
[01HWQ6XNQNZ415BZEMJHKS0MW8] Please be aware that the run changes calculation includes output changes.
[01HWQ6XNQNZ415BZEMJHKS0MW8] Resource list upload is GO
[01HWQ6XNQNZ415BZEMJHKS0MW8] Generating JSON representations of the plans...
[01HWQ6XNQNZ415BZEMJHKS0MW8] Retrieving the dependency graph...
[01HWQ6XNQNZ415BZEMJHKS0MW8] Getting path for module us-east-1/playground/vpc
[01HWQ6XNQNZ415BZEMJHKS0MW8] Generating JSON representation of the plan for /mnt/workspace/source/infra/dev-cp/us-east-1/playground/vpc/.terragrunt-cache/pg7Za_BKUWEJgkQm4x2U-N6PXZg/A35GeYiqYDYXDWZftKtd1kkU5ic ...
[01HWQ6XNQNZ415BZEMJHKS0MW8] Loading custom plan policy inputs...
[01HWQ6XNQNZ415BZEMJHKS0MW8] 0 custom plan policy inputs found
[01HWQ6XNQNZ415BZEMJHKS0MW8] No plan policies to evaluate
```

</details>